app/controllers/brands_controller.rb

  def index
    @brands = Brand.all
---
SELECT "brands".* FROM "brands"

  def create
    @brand = Brand.new(brand_params)

    respond_to do |format|
      if @brand.save
---
INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Apple"], ["created_at", 2016-11-27 07:29:25 UTC], ["updated_at", 2016-11-27 07:29:25 UTC]]

  def update
    respond_to do |format|
      if @brand.update(brand_params)
---
UPDATE "brands" SET "name" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["name", "microsoft"], ["updated_at", 2016-11-28 19:16:47 UTC], ["id", 15]]

  def destroy
    @brand.destroy
---
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 2]]

    def set_brand
      @brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]