app/controllers/products_controller.rb

SELECT  "brands".* FROM "brands" ORDER BY "brands"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def new
    @product = Product.new
	@brands = Brand.all

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at", "brand_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "blah"], ["description", "asdf"], ["price", 12.0], ["created_at", 2016-11-28 19:51:21 UTC], ["updated_at", 2016-11-28 19:51:21 UTC], ["brand_id", 16]]
---
  def create
	# if product_params
	# 	brand = Brand.find_by name: params[:product][:brand]
	# 	puts brand.inspect
	# 	params[:product][:brand] = brand
	# 	params.permit!
	# end
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = ?, "brand_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Lenovo"], ["brand_id", 3], ["updated_at", 2016-12-10 21:21:43 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)