app/views/products/_form.html.erb

  	<%= f.label :brand %>
	<%= f.collection_select(:brand_id, Brand.all, :id, :name, prompt: true) %>
---
SELECT  "brands".* FROM "brands" WHERE "brands"."name" = ? LIMIT ?  [["name", "blah"], ["LIMIT", 1]]