app/views/products/index.html.erb

SELECT  "brands".* FROM "brands" ORDER BY "brands"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
	        <td><%= product.name %></td>
	        	<% if Brand.first != nil %>
				<td><%= Brand.find(product.brand_id).name %></td>