app/views/products/show.html.erb

	  <strong>Make:</strong>
	  <%= Brand.find(@product.brand_id).name %>
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]